Revit 2027 API
ElementCategoryFilter Constructor
Overload List
Name | Description
ElementCategoryFilter(BuiltInCategory) |  Constructs a new instance of a filter to match elements by category.
ElementCategoryFilter(ElementId) |  Constructs a new instance of a filter to match elements by category.
ElementCategoryFilter(BuiltInCategory, Boolean) |  Constructs a new instance of a filter to match elements by category, with the option to match all elements which are not of the given category.
ElementCategoryFilter(ElementId, Boolean) |  Constructs a new instance of a filter to match elements by category, with the option to match all elements which are of the given category.
Top
See Also
Reference
ElementCategoryFilter Class
Autodesk.Revit.DB Namespace